#include <stdio.h>
#include <stdlib.h>
#include <math.h>
float fync(float a1,float b1,float a2,float b2){     // опис функції
float ab;    //опис ab
ab=sqrt((a1-a2)*(a1-a2)+(b1-b2)*(b1-b2));  // значення нашого ab (за формулою відстані між точками)
return ab;}             // повернення зміннної ab
          

int main(int argc, char *argv[]) {  // основна програма
	float t,p1,p2,s1,s2,x1,x2,x3,x4,x5,x6,y1,y2,y3,y4,y5,y6;            // опис змінних
  	   printf("vvedit koord 1 trykutnyka\n");         // оголошення(текст введіть коорд 1 трикутника)
	printf("vvedit x i y tocky 1 ");         // оголошення(текст введіть коорд 1 т)
	scanf("%f%f",&x1,&y1);              // зчитування чисел(координат)
	printf("vvedit x i y tocky 2 ");         // оголошення(текст введіть коорд 2 т)
	scanf("%f%f",&x2,&y2);              // зчитування чисел (координат)
	printf("vvedit x i y tocky 3 ");         // оголошення(текст введіть коорд 3 точки)
	scanf("%f%f",&x3,&y3);              // зчитування чисел(координат)
	
	printf("vvedit koord 2 trykutnyka\n");         // оголошення(текст введіть коорд 2 трик)
	printf("vvedit x i y tocky 1 ");         // оголошення(текст введіть коорд 1 т)
	scanf("%f%f",&x4,&y4);              // зчитування чисел(координат)
	printf("vvedit x i y tocky 2 ");         // оголошення(текст введіть коорд 2 т)
	scanf("%f%f",&x5,&y5);              // зчитування чисел (координат)
	printf("vvedit x i y tocky 3 ");         // оголошення(текст введіть коорд 3 точки)
	scanf("%f%f",&x6,&y6);              // зчитування чисел(координат)
    
	
	p1=(fync(x1,y1,x2,y2)+fync(x2,y2,x3,y3)+fync(x3,y3,x1,y1))/2; //звернення до функції знаходження відстаней між точками -сторін і обрахування півпериметра 
    s1=sqrt(p1*(p1-fync(x1,y1,x2,y2))*(p1-(fync(x2,y2,x3,y3)))*(p1-fync(x3,y3,x1,y1))); //за ф герона шукаємо площу 1
    
	p2=(fync(x4,y4,x5,y5)+fync(x5,y5,x6,y6)+fync(x6,y6,x4,y4))/2;//звернення до функції знаходження відстаней між точками -сторін і обрахування півпериметра
    s2=sqrt(p2*(p2-fync(x4,y4,x5,y5))*(p2-fync(x5,y5,x6,y6))*(p2-fync(x6,y6,x4,y4))); //за ф герона шукаємо площу 2
 //порівнюємо площі

	if(s1>s2)
	printf("\n plosca 1 == %f",s1);         // вивід значення площі 1 більша  
	if(s2>s1)
	printf("\n plosca 2 == %f",s2);         // вивід значення площі 1 більша 
    if(s1==s2)
	printf("\n plosca 1 ==plosca 2 == %f",s1);         // вивід значення площі 1 бо рівні 

    
	return 0;
}

