#include <stdio.h>
#include <stdlib.h> 
#include <math.h>
float fync(float A,float B,float C){     //описуємо функцію
float d,x1,x2;      //описуємо змінні самої функції
d=pow(B,2)-4*A*C;  // шукаємо дискримінант
if (d<0)    // якщо він менше нуля то розвязків немає і виводимо повідомлення
printf("d<0 rozvyazkyv nemae"); // повідомлення
  
if ((d>0)||(d==0)){   //якщо ж він більший чи дор 0 то шукаємо розвязки 
x1=(-B+sqrt(d))/(2*A); // розвязок 1
x2=(-B-sqrt(d))/(2*A);  // розвязок 2
printf("x1==%0.2f",x1); // виводимо 1 розвязок (їх можна вивести зразу щоб не повертати в програму)
printf("\nx2=%0.2f ",x2);}  // виводимо розвязок 2 
}

int main(){ //основна програма
float a,b,c; // опис змінних
printf("Vvedit a,b,c"); // повідомлення
scanf("%f%f%f", &a,&b,&c); // зчитуємо а б с
fync(a,b,c); // передаємо їх функції

return 0;
}
